Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: You do not need to wrap common letters, numbers or even some symbols such as . (period) in curly brackets.
pt_br: Você não precisa envolver letras comuns, números e nem mesmo uns símbolos tais como . (ponto final) em chaves.

source: You don't know where an object's code or variables actually reside, so you must pass a message to the object, like "give me foo" or "go do bar", and rely on the object to respond to the message.
pt_br: Você não sabe onde um código ou variáveis de um objeto efetivamente ficam, então você deve passar uma mensagem ao objeto, como “dê-me foo” ou “vá fazer bar”, e esperar que o objeto responda a essa mensagem.

source: You have a list of things where each thing has a name, such as the characteristics of a fruit (this would be referred to as an associative array)
pt_br: Ou você tem uma lista de coisas em que cada uma tem um nome, como as características de uma fruta (o que seria referido como um vetor associativo).

source: You might be wondering "How the crud am I supposed to know that ^ means Ctrl?!".
pt_br: Você deve estar pensando “Mas como eu vou saber que ^ significa Ctrl?!”

source: You need to fix the error in your script before you can get your tray icon back.
pt_br: Você deve reparar o erro em seu script antes que você obtenha seu ícone de bandeja novamente.

source: You ran AutoHotkey without telling it which script file to run, and it couldn't find a script in either of the usual places.
pt_br: Porque você executou o AutoHotkey sem dizer-lhe qual arquivo de script ele deve executar, e ele também não pôde encontrar um script em nenhum dos locais comuns.

source: You release a reference by simply using an assignment to replace it with any other value.
pt_br: Você libera uma referência ao simplesmente usar uma atribuição para substituí-la por qualquer outro valor.

source: You should also try running the game in windowed mode, if possible.
pt_br: Você também deve tentar rodar o jogo em modo de janela (windowed), se possível.

source: You should get a prompt asking whether you want to install with default options.
pt_br: Você deverá ver uma mensagem perguntando se você quer instalar com as opções padrão.

source: You should then see AutoHotkey Help File.
pt_br: Aí você deverá ver o Arquivo de ajuda do AutoHotkey (AutoHotkey help file).

source: You want to have a numbered list of things, such as a grocery list (this would be referred to as an indexed array)
pt_br: Você precisa de uma lista numerada de itens, como uma lista de compras (que é referenciada como um vetor indexado).

source: You want to represent a grid, perhaps for a board game (this would be done with nested objects)
pt_br: Você quer representar uma grade, quem sabe para um jogo de tabuleiro (o que seria feito com objetos aninhados).

source: You will get a message box with the word "Yellow", because that is what we set the key Color to in the previous section.
pt_br: Disso você obterá uma caixa de mensagem com a palavra “Amarelo”, porque é esse o valor que armazenamos na chave Cor na seção anterior.

source: You will learn a lot this way by reading the documentation, reading errors and learning what works and what doesn't.
pt_br: Você vai aprender um bocado desse jeito lendo a documentação, lendo os erros e descobrindo o que funciona e o que não.

source: Your Documents (or My Documents) folder.
pt_br: Sua pasta de Documentos (ou Meus Documentos).

source: Your code will run perfectly fine without it, but it will be a major headache for you and other to read your code.
pt_br: Seu código irá executar perfeitamente sem ela, mas será uma grande dor de cabeça para você e outros para lerem seu código.

source: Your first script is done.
pt_br: Seu primeiro script está pronto.

source: ["#Directives","",
pt_br: ["Diretivas com #","",

source: ["Acknowledgements","misc/Acknowledgements.htm"],
pt_br: ["Agradecimentos","misc/Acknowledgements.htm"],

source: ["ActiveX controls (GUI)","commands/GuiControls.htm#ActiveX"],
pt_br: ["controles do ActiveX (GUI)","commands/GuiControls.htm#ActiveX"],

source: ["AddResource directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#AddResource",99],
pt_br: ["diretiva AddResource (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#AddResource",99],

source: ["Address of a variable","Variables.htm#amp"],
pt_br: ["Endereço de uma variável","Variables.htm#amp"],

source: ["AutoIt v2 compatibility","misc/AutoIt2Compat.htm"],
pt_br: ["Compatibilidade com AutoIt v2","misc/AutoIt2Compat.htm"],

source: ["Basic Usage","Objects.htm#Usage"],
pt_br: ["Noções Básicas de Uso","Objects.htm#Usage"],

source: ["Bin directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Bin",99],
pt_br: ["Diretiva Bin (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Bin",99],

source: ["BinMod script (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#PostExec",99],
pt_br: ["Script BinMode (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#PostExec",99],

source: ["Bind method (Func object)","objects/Func.htm#Bind"],
pt_br: ["Método Bind (Objeto Funcional)","objects/Func.htm#Bind"],

source: ["BoundFunc object","objects/Functor.htm#BoundFunc"],
pt_br: ["Objeto atrelado à função (Func.Bind)","objects/Functor.htm#BoundFunc"],

source: ["Button controls (GUI)","commands/GuiControls.htm#Button"],
pt_br: ["Controles de botão (GUI)","commands/GuiControls.htm#Button"],

source: ["CLSID List (My Computer, etc.)","misc/CLSID-List.htm"],
pt_br: ["Lista CLSID (Meu computador, etc.)","misc/CLSID-List.htm"],

source: ["Call method (Func object)","objects/Func.htm#Call"],
pt_br: ["método Call (Objeto Func)","objects/Func.htm#Call"],

source: ["Checkbox controls (GUI)","commands/GuiControls.htm#Checkbox"],
pt_br: ["Controles de checkbox (GUI)","commands/GuiControls.htm#Checkbox"],

source: ["Click a mouse button","commands/Click.htm"],
pt_br: ["Clicar um botão do mouse","commands/Click.htm"],

source: ["Clone method (Object)","objects/Object.htm#Clone"],
pt_br: ["Método clonar (Objeto)","objects/Object.htm#Clone"],

source: ["Close method (File)","objects/File.htm#Close"],
pt_br: ["Método close (Arquivo)","objects/File.htm#Close"],

source: ["ComboBox controls (GUI)","commands/GuiControls.htm#ComboBox"],
pt_br: ["Controles de ComboBox (GUI)","commands/GuiControls.htm#ComboBox"],

source: ["Command and Function Index","commands/index.htm"],
pt_br: ["Índice de Comandos e Funções","commands/index.htm"],

source: ["Compatibility","Compat.htm"],
pt_br: ["Compatibilidade","Compat.htm"],

source: ["Compiler Directives","misc/Ahk2ExeDirectives.htm"],
pt_br: ["Diretivas do compilador","misc/Ahk2ExeDirectives.htm"],["Diretivas de Compiladores","misc/Ahk2ExeDirectives.htm"],

source: ["Concepts and Conventions","Concepts.htm"],
pt_br: ["Conceitos e Convenções","Concepts.htm"],

source: ["ConsoleApp directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#ConsoleApp",99],
pt_br: ["Diretiva ConsoleApp (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#ConsoleApp",99],

source: ["Cont directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Cont",99],
pt_br: ["Diretiva Continuação (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Cont",99],

source: ["Controls","",
pt_br: ["Controles","",

source: ["Count method (Object)","objects/Object.htm#Count"],
pt_br: ["Método Count (Objeto)","objects/Object.htm#Count"],

source: ["Custom Objects","Objects.htm#Custom_Objects"],
pt_br: ["Objetos Personalizados","Objects.htm#Custom_Objects"],

source: ["Custom controls (GUI)","commands/GuiControls.htm#Custom"],
pt_br: ["Controles personalizados (GUI)","commands/GuiControls.htm#Custom"],

source: ["DPI scaling","commands/Gui.htm#DPIScale"],
pt_br: ["Escala de DPI","commands/Gui.htm#DPIScale"],

source: ["DateTime controls (GUI)","commands/GuiControls.htm#DateTime"],
pt_br: ["Controles DateTime (GUI)","commands/GuiControls.htm#DateTime"],

source: ["Debug directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Debug",99],
pt_br: ["Diretiva de depuração (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Debug",99],

source: ["Debugging Clients","AHKL_DBGPClients.htm"],
pt_br: ["Clientes de Depuração","AHKL_DBGPClients.htm"],

source: ["Default Base Object","Objects.htm#Default_Base_Object"],
pt_br: ["Objeto Base Padrão","Objects.htm#Default_Base_Object"],

source: ["Delete method (Object)","objects/Object.htm#Delete"],
pt_br: ["Método Delete (Objeto)","objects/Object.htm#Delete"],

source: ["DropDownList controls (GUI)","commands/GuiControls.htm#DropDownList"],
pt_br: ["controles DropDownList (GUI)","commands/GuiControls.htm#DropDownList"],

source: ["Edit controls (GUI)","commands/GuiControls.htm#Edit"],
pt_br: ["controles Edit (GUI)","commands/GuiControls.htm#Edit"],

source: ["Encoding property (File)","objects/File.htm#Encoding"],
pt_br: ["Codificação (Arquivo)","objects/File.htm#Encoding"],

source: ["Enumerator Object","objects/Enumerator.htm"],
pt_br: ["Enumerador","objects/Enumerator.htm"],

source: ["Enumerator object","objects/Enumerator.htm"],
pt_br: ["Objeto enumerador","objects/Enumerator.htm"],

source: ["Environment","",
pt_br: ["Ambiente","",

source: ["Exception Object","commands/Throw.htm#Exception"],
pt_br: ["Exceção","commands/Throw.htm#Exception"],

source: ["ExeName directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#ExeName",99],
pt_br: ["diretiva ExeName (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#ExeName",99],

source: ["Extended Usage","Objects.htm#Extended_Usage"],
pt_br: ["Uso Estendido","Objects.htm#Extended_Usage"],

source: ["External Libraries","",
pt_br: ["Bibliotecas Externas","",

source: ["FAQ (Frequently Asked Questions)","FAQ.htm"],
pt_br: ["FAQ (Perguntas Frequentes)","FAQ.htm"],

source: ["FTP uploading example","commands/FileAppend.htm#FTP"],
pt_br: ["exemplo de upload via FTP","commands/FileAppend.htm#FTP"],

source: ["File Object","objects/File.htm"],
pt_br: ["Arquivo","objects/File.htm"],

source: ["File object","objects/File.htm"],
pt_br: ["objeto arquivo","objects/File.htm"],

source: ["File, Directory and Disk","",
pt_br: ["Arquivos, Diretórios e Discos","",

source: ["Flow of Control","",
pt_br: ["Fluxo de Controle","",

source: ["Frequently Asked Questions","FAQ.htm"],
pt_br: ["Perguntas Frequentes (FAQ)","FAQ.htm"],

source: ["Func Object","objects/Func.htm"],
pt_br: ["Func","objects/Func.htm"],

source: ["Func object","objects/Func.htm"],
pt_br: ["Func","objects/Func.htm"],

source: ["Function Objects","objects/Functor.htm"],
pt_br: ["Objetos de Função","objects/Functor.htm"],

source: ["Functions","Functions.htm"],
pt_br: ["Funções","Functions.htm"],

source: ["GetAddress method (Object)","objects/Object.htm#GetAddress"],
pt_br: ["método GetAddress (Objeto)","objects/Object.htm#GetAddress"],

source: ["GetCapacity method (Object)","objects/Object.htm#GetCapacity"],
pt_br: ["método GetCapacity (Objeto)","objects/Object.htm#GetCapacity"],

source: ["Graphical User Interfaces","",
pt_br: ["Interfaces Gráficas do Usuário","",

source: ["GroupBox controls (GUI)","commands/GuiControls.htm#GroupBox"],
pt_br: ["controles GroupBox (GUI)","commands/GuiControls.htm#GroupBox"],

source: ["Gui ListView control","commands/ListView.htm"],
pt_br: ["Controle ListView da Gui","commands/ListView.htm"],

source: ["Gui TreeView control","commands/TreeView.htm"],
pt_br: ["Controle TreeView da Gui","commands/TreeView.htm"],

source: ["Gui control types","commands/GuiControls.htm"],
pt_br: ["Tipos de controles da Gui","commands/GuiControls.htm"],

source: ["Gui styles reference","misc/Styles.htm"],
pt_br: ["referência de estilos de GUIs","misc/Styles.htm"],

source: ["HTML color names","commands/Progress.htm#colors"],
pt_br: ["nomes das cores no HTML","commands/Progress.htm#colors"],

source: ["HWND (of a control)","commands/ControlGet.htm#Hwnd"],
pt_br: ["HWND (de um controle)","commands/ControlGet.htm#Hwnd"],

source: ["HWND (of a window)","misc/WinTitle.htm#ahk_id"],
pt_br: ["HWND (de uma janela)","misc/WinTitle.htm#ahk_id"],

source: ["HasKey method (Object)","objects/Object.htm#HasKey"],
pt_br: ["método HasKey (Objeto)","objects/Object.htm#HasKey"],

source: ["Hotkey controls (GUI)","commands/GuiControls.htm#Hotkey"],
pt_br: ["controles de Hotkeys (GUI)","commands/GuiControls.htm#Hotkey"],

source: ["Hotkey, other features","HotkeyFeatures.htm"],
pt_br: ["Hotkey, outras características","HotkeyFeatures.htm"],

source: ["Hotkeys (general information)","Hotkeys.htm"],
pt_br: ["Hotkeys (informações gerais)","Hotkeys.htm"],

source: ["Hotkeys and Hotstrings","Hotkeys.htm",
pt_br: ["Hotkeys e Hotstrings","Hotkeys.htm",

source: ["Hotstrings (general information)","Hotstrings.htm"],
pt_br: ["Hotstrings (informações gerais)","Hotstrings.htm"],

source: ["ID number for a window","commands/WinGet.htm"],
pt_br: ["número ID de uma janela","commands/WinGet.htm"],

source: ["If (expression)","commands/IfExpression.htm"],
pt_br: ["If (expressão)","commands/IfExpression.htm"],

source: ["If (legacy)","commands/IfEqual.htm"],
pt_br: ["If (forma legada)","commands/IfEqual.htm"],

source: ["If (traditional)","commands/IfEqual.htm"],
pt_br: ["If (tradicional)","commands/IfEqual.htm"],

source: ["IgnoreBegin directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#IgnoreKeep",99],
pt_br: ["Diretiva IgnoreBegin (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#IgnoreKeep",99],

source: ["IgnoreEnd directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#IgnoreKeep",99],
pt_br: ["Diretiva IgnoreEnd (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#IgnoreKeep",99],

source: ["Image Lists (GUI)","commands/ListView.htm#IL"],
pt_br: ["Listas de Imagens (GUI)","commands/ListView.htm#IL"],

source: ["Implementation","Objects.htm#Implementation"]
pt_br: ["Implementação","Objects.htm#Implementation"]

source: ["Insert method (Object)","objects/Object.htm#Insert"],
pt_br: ["Método Insert (Objeto)","objects/Object.htm#Insert"],

source: ["InsertAt method (Object)","objects/Object.htm#InsertAt"],
pt_br: ["Método InsertAt (Objeto)","objects/Object.htm#InsertAt"],

source: ["JScript, embedded/inline","commands/DllCall.htm#COM"],
pt_br: ["JScript, embutido/'inline'","commands/DllCall.htm#COM"],

source: ["Join (continuation sections)","Scripts.htm#Join"],
pt_br: ["Join (continuações de seção)","Scripts.htm#Join"],

source: ["Keep directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#IgnoreKeep",99],
pt_br: ["Diretiva Keep (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#IgnoreKeep",99],

source: ["Labels","misc/Labels.htm"],
pt_br: ["Rótulos","misc/Labels.htm"],

source: ["Length method (Object)","objects/Object.htm#Length"],
pt_br: ["método Lenght (Objeto)","objects/Object.htm#Length"],

source: ["Length property (File)","objects/File.htm#Length"],
pt_br: ["propriedade Lenght (Arquivo)","objects/File.htm#Length"],

source: ["Let directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Let",99],
pt_br: ["Diretiva Let (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Let",99],

source: ["Link controls (GUI)","commands/GuiControls.htm#Link"],
pt_br: ["Controles de link (GUI)","commands/GuiControls.htm#Link"],

source: ["List of Keys","KeyList.htm"],
pt_br: ["Lista de Teclas","KeyList.htm"],

source: ["ListBox controls (GUI)","commands/GuiControls.htm#ListBox"],
pt_br: ["Controles de caixa de listagem (GUI)","commands/GuiControls.htm#ListBox"],

source: ["ListView controls (GUI)","commands/ListView.htm"],
pt_br: ["Controles de visualização de lista (ListView) (GUI)","commands/ListView.htm"],

source: ["ListView, getting text from","commands/ControlGet.htm#List"],
pt_br: ["Visualização de lista, obter texto de","commands/ControlGet.htm#List"],

source: ["Locale","commands/StringCaseSense.htm#Locale"],
pt_br: ["Localização geográfica","commands/StringCaseSense.htm#Locale"],

source: ["Long Paths","misc/LongPaths.htm"],
pt_br: ["Caminhos Longos","misc/LongPaths.htm"],

source: ["Loop (files & folders)","commands/LoopFile.htm"],
pt_br: ["Loop (arquivos e pastas)","commands/LoopFile.htm"],

source: ["Loop (parse a string)","commands/LoopParse.htm"],
pt_br: ["Loop (analisar uma string)","commands/LoopParse.htm"],

source: ["Loop (read file contents)","commands/LoopReadFile.htm"],
pt_br: ["Loop (ler conteúdo de um arquivo)","commands/LoopReadFile.htm"],

source: ["Loop (registry)","commands/LoopReg.htm"]
pt_br: ["Loop (registro)","commands/LoopReg.htm"]

source: ["Maths","commands/Math.htm",
pt_br: ["Operações Matemáticas","commands/Math.htm",

source: ["MaxIndex method (Object)","objects/Object.htm#MinMaxIndex"],
pt_br: ["Método MaxIndex (Objeto)","objects/Object.htm#MinMaxIndex"],

source: ["Menu Bar (GUI)","commands/Gui.htm#Menu"],
pt_br: ["Barra de Menu (GUI)","commands/Gui.htm#Menu"],

source: ["Menu Icon","commands/Menu.htm#MenuIcon"],
pt_br: ["Ícone de Menu","commands/Menu.htm#MenuIcon"],

source: ["MinIndex method (Object)","objects/Object.htm#MinMaxIndex"],
pt_br: ["Método MinIndex (Objeto)","objects/Object.htm#MinMaxIndex"],

source: ["Misc.","",
pt_br: ["Diversos","",

source: ["MonthCal controls (GUI)","commands/GuiControls.htm#MonthCal"],
pt_br: ["Controles de MonthCal (GUI)","commands/GuiControls.htm#MonthCal"],

source: ["Mouse and Keyboard","",
pt_br: ["Mouse e Teclado","",

source: ["NewEnum method (Object)","objects/Object.htm#NewEnum"],
pt_br: ["Método NewEnum (Objeto)","objects/Object.htm#NewEnum"],

source: ["Obey directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Obey",99],
pt_br: ["Diretiva Obey (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Obey",99],

source: ["Object Types","",
pt_br: ["Tipos de Objetos","",

source: ["Object functions and methods","objects/Object.htm"],
pt_br: ["Funções e métodos de objetos","objects/Object.htm"],

source: ["Object","objects/Object.htm"],
pt_br: ["Objeto","objects/Object.htm"],

source: ["Objects (general information)","Objects.htm"],
pt_br: ["Objetos (informações gerais)","Objects.htm"],

source: ["Objects","Objects.htm",
pt_br: ["Objetos","Objects.htm",

source: ["Owner of a GUI window","commands/Gui.htm#Owner"],
pt_br: ["Proprietário de uma janela de GUI","commands/Gui.htm#Owner"],

source: ["Picture controls (GUI)","commands/GuiControls.htm#Picture"],
pt_br: ["Controles de imagens (GUI)","commands/GuiControls.htm#Picture"],

source: ["Pop method (Object)","objects/Object.htm#Pop"],
pt_br: ["Método Pop (Objeto)","objects/Object.htm#Pop"],

source: ["Pos property (File)","objects/File.htm#Seek"],
pt_br: ["Propriedade Pos (Arquivo)","objects/File.htm#Seek"],

source: ["PostExec directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#PostExec",99],
pt_br: ["Diretiva PostExec (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#PostExec",99],

source: ["Process","",
pt_br: ["Processos","",

source: ["Progress controls (GUI)","commands/GuiControls.htm#Progress"],
pt_br: ["Controles de progresso (GUI)","commands/GuiControls.htm#Progress"],

source: ["Push method (Object)","objects/Object.htm#Push"],
pt_br: ["método Push (Objeto)","objects/Object.htm#Push"],

source: ["Quick Reference","AutoHotkey.htm"],
pt_br: ["Referência Rápida","AutoHotkey.htm"],

source: ["RGB color names","commands/Progress.htm#colors"],
pt_br: ["Nomes das cores RGB","commands/Progress.htm#colors"],

source: ["RGB colors","commands/PixelGetColor.htm"],
pt_br: ["Cores RGB","commands/PixelGetColor.htm"],

source: ["Radio controls (GUI)","commands/GuiControls.htm#Radio"],
pt_br: ["Controles de botões de seleção (GUI)","commands/GuiControls.htm#Radio"],

source: ["RawRead method (File)","objects/File.htm#RawRead"],
pt_br: ["Método RawRead (Arquivo)","objects/File.htm#RawRead"],

source: ["RawWrite method (File)","objects/File.htm#RawWrite"],
pt_br: ["Método RawWrite (Arquivo)","objects/File.htm#RawWrite"],

source: ["Read method (File)","objects/File.htm#Read"],
pt_br: ["Método Read (Arquivo)","objects/File.htm#Read"],

source: ["ReadLine method (File)","objects/File.htm#ReadLine"],
pt_br: ["Método ReadLine (Arquivo)","objects/File.htm#ReadLine"],

source: ["ReadNumType method (File)","objects/File.htm#ReadNum"],
pt_br: ["Método ReadNumType (Arquivo)","objects/File.htm#ReadNum"],

source: ["Recent Changes","AHKL_ChangeLog.htm"],
pt_br: ["Mudanças Recentes","AHKL_ChangeLog.htm"],

source: ["Reference-Counting","Objects.htm#Refs"],
pt_br: ["Contagem de referência","Objects.htm#Refs"],

source: ["RegEx:
pt_br: ["RegExes:

source: ["RegExMatch Object","commands/RegExMatch.htm#MatchObject"]
pt_br: ["RegExMatch","commands/RegExMatch.htm#MatchObject"]

source: ["Registry","",
pt_br: ["Registro","",

source: ["Regular Expression Callouts","misc/RegExCallout.htm"],
pt_br: ["Chamadas em Expressões Regulares","misc/RegExCallout.htm"],

source: ["Remapping Keys","misc/Remap.htm"],
pt_br: ["Remapeando Teclas","misc/Remap.htm"],

source: ["Remove method (Object)","objects/Object.htm#Remove"],
pt_br: ["Método Remove (Objeto)","objects/Object.htm#Remove"],

source: ["RemoveAt method (Object)","objects/Object.htm#RemoveAt"],
pt_br: ["Método RemoveAt (Objeto)","objects/Object.htm#RemoveAt"],

source: ["Screen","",
pt_br: ["Tela","",

source: ["Script Compatibility","Compat.htm"],
pt_br: ["Compatibilidade de Scripts","Compat.htm"],

source: ["Script Showcase","scripts/index.htm"],
pt_br: ["Mostra de scripts","scripts/index.htm"],["Mostruário de Scripts","scripts/index.htm"],

source: ["Scripting Language","Language.htm"],
pt_br: ["Linguagem de scripts","Language.htm"],

source: ["Scripts (misc)","Scripts.htm"],
pt_br: ["Scripts (diversos)","Scripts.htm"],

source: ["Seek method (File)","objects/File.htm#Seek"],
pt_br: ["Método Seek (Arquivo)","objects/File.htm#Seek"],

source: ["Set directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Set",99],
pt_br: ["Diretiva Set (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#Set",99],

source: ["SetCapacity method (Object)","objects/Object.htm#SetCapacity"],
pt_br: ["Método SetCapacity (Objeto)","objects/Object.htm#SetCapacity"],

source: ["Silent Install/Uninstall","Program.htm#install"],
pt_br: ["Instalação/Desinstalação silenciosa","Program.htm#install"],

source: ["Slider controls (GUI)","commands/GuiControls.htm#Slider"],
pt_br: ["Controles de Slider (GUI)","commands/GuiControls.htm#Slider"],

source: ["Sound","",
pt_br: ["Som","",

source: ["Standard Windows Fonts","misc/FontsStandard.htm"],
pt_br: ["Fontes Padrão do Windows","misc/FontsStandard.htm"],

source: ["StatusBar controls (GUI)","commands/GuiControls.htm#StatusBar"],
pt_br: ["Controles da barra de status (GUI)","commands/GuiControls.htm#StatusBar"],

source: ["String","",
pt_br: ["Strings","",

source: ["Styles for a window/control","misc/Styles.htm"],
pt_br: ["Estilos para janelas/controles","misc/Styles.htm"],

source: ["Super-global variables","Functions.htm#SuperGlobal"],
pt_br: ["Variáveis supraglobais","Functions.htm#SuperGlobal"],

source: ["Tab controls (GUI)","commands/GuiControls.htm#Tab"],
pt_br: ["Controles de várias abas (GUI)","commands/GuiControls.htm#Tab"],

source: ["Tell method (File)","objects/File.htm#Tell"],
pt_br: ["Método Tell (Arquivo)","objects/File.htm#Tell"],

source: ["Text controls (GUI)","commands/GuiControls.htm#Text"],
pt_br: ["Controles de texto (GUI)","commands/GuiControls.htm#Text"],

source: ["Threads","misc/Threads.htm"],
pt_br: ["Linhas de Execução (Threads)","misc/Threads.htm"],

source: ["Timer (timed subroutines)","commands/SetTimer.htm"],
pt_br: ["Timer (sub-rotinas baseadas em tempo)","commands/SetTimer.htm"],

source: ["TreeView controls (GUI)","commands/TreeView.htm"],
pt_br: ["Controles de visualização em árvore de blocos (GUI)","commands/TreeView.htm"],

source: ["Tutorial (quick start)","Tutorial.htm"],
pt_br: ["Tutorial (início rápido)","Tutorial.htm"],

source: ["Unicode text and clipboard","commands/Transform.htm"],
pt_br: ["Texto Unicode e área de transferência","commands/Transform.htm"],

source: ["UpDown controls (GUI)","commands/GuiControls.htm#UpDown"],
pt_br: ["Controles de setas de incremento/diminuição (GUI)","commands/GuiControls.htm#UpDown"],

source: ["UpdateManifest directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#UpdateManifest",99],
pt_br: ["Diretiva UpdateManifest (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#UpdateManifest",99],
